{
  "architectures": [
    "MobileViTForImageClassification"
  ],
  "aspp_dropout_prob": 0.1,
  "aspp_out_channels": 256,
  "atrous_rates": [
    6,
    12,
    18
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "conv_kernel_size": 3,
  "dtype": "float32",
  "expand_ratio": 4.0,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.1,
  "hidden_sizes": [
    144,
    192,
    240
  ],
  "image_size": 256,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 2.0,
  "model_type": "mobilevit",
  "neck_hidden_sizes": [
    16,
    32,
    64,
    96,
    128,
    160,
    640
  ],
  "num_attention_heads": 4,
  "num_channels": 3,
  "output_stride": 32,
  "patch_size": 2,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "semantic_loss_ignore_index": 255,
  "transformers_version": "4.57.2"
}
